<details><summary>Digger run report at 2024-09-03 08:28:29 (UTC)</summary>
      <details><summary>Locking successful</summary>
  Project anzeha/floorball-fantasy-infra#infrastructure-live_cd-clusters_dev_cluster has been locked by PR #15
</details>

<details><summary>Plan for <b>anzeha/floorball-fantasy-infra#infrastructure-live_cd-clusters_dev_cluster</b></summary>
  
```terraform
Terraform will perform the following actions:

  # module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = 110
      + deletion_protection                      = false
      + enable_cilium_clusterwide_network_policy = false
      + enable_intranode_visibility              = false
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = false
      + enable_legacy_abac                       = false
      + enable_multi_networking                  = false
      + enable_shielded_nodes                    = true
      + enable_tpu                               = false
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + label_fingerprint                        = (known after apply)
      + location                                 = "europe-west4-a"
      + logging_service                          = "none"
      + master_version                           = (known after apply)
      + monitoring_service                       = "none"
      + name                                     = "deployment-gke-cluster-dev"
      + network                                  = "projects/deployment-433913/global/networks/deployment-gke-network-dev"
      + networking_mode                          = (known after apply)
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = "deployment-433913"
      + remove_default_node_pool                 = true
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = "projects/deployment-433913/regions/europe-west4/subnetworks/deployment-gke-subnet-dev"
      + tpu_ipv4_cidr_block                      = (known after apply)
        # (1 unchanged attribute hidden)

      + addons_config {
          + cloudrun_config (known after apply)
          + config_connector_config {
              + enabled = false
            }
          + dns_cache_config {
              + enabled = false
            }
          + gce_persistent_disk_csi_driver_config {
              + enabled = true
            }
          + gcp_filestore_csi_driver_config {
              + enabled = false
            }
          + gcs_fuse_csi_driver_config (known after apply)
          + gke_backup_agent_config {
              + enabled = false
            }
          + horizontal_pod_autoscaling {
              + disabled = true
            }
          + http_load_balancing {
              + disabled = false
            }
          + network_policy_config {
              + disabled = true
            }
          + ray_operator_config (known after apply)
          + stateful_ha_config (known after apply)
        }

      + authenticator_groups_config (known after apply)

      + cluster_autoscaling {
          + auto_provisioning_locations = (known after apply)
          + autoscaling_profile         = "BALANCED"
          + enabled                     = false

          + auto_provisioning_defaults (known after apply)
        }

      + confidential_nodes (known after apply)

      + cost_management_config (known after apply)

      + database_encryption {
          + state    = "DECRYPTED"
            # (1 unchanged attribute hidden)
        }

      + default_snat_status {
          + disabled = false
        }

      + gateway_api_config (known after apply)

      + identity_service_config (known after apply)

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "ip-range-pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "ip-range-services"
          + stack_type                    = "IPV4"

          + pod_cidr_overprovision_config (known after apply)
        }

      + logging_config (known after apply)

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "05:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + master_authorized_networks_config (known after apply)

      + mesh_certificates {
          + enable_certificates = false
        }

      + monitoring_config (known after apply)

      + network_policy {
          + enabled = false
        }

      + node_config (known after apply)

      + node_pool {
          + initial_node_count          = 0
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = "default-pool"
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + management {
              + auto_repair  = true
              + auto_upgrade = true
            }

          + network_config (known after apply)

          + node_config {
              + disk_size_gb                = (known after apply)
              + disk_type                   = (known after apply)
              + effective_taints            = (known after apply)
              + enable_confidential_storage = false
              + guest_accelerator           = (known after apply)
              + image_type                  = "COS_CONTAINERD"
              + labels                      = (known after apply)
              + local_ssd_count             = (known after apply)
              + logging_variant             = "DEFAULT"
              + machine_type                = "e2-standard-2"
              + metadata                    = (known after apply)
              + min_cpu_platform            = (known after apply)
              + oauth_scopes                = (known after apply)
              + preemptible                 = false
              + service_account             = "tf-gke-deployment-gke--edxt@deployment-433913.iam.gserviceaccount.com"
              + spot                        = false
              + tags                        = [
                  + "gke-deployment-gke-cluster-dev",
                  + "gke-deployment-gke-cluster-dev-default-pool",
                ]

              + confidential_nodes (known after apply)

              + shielded_instance_config {
                  + enable_integrity_monitoring = true
                  + enable_secure_boot          = false
                }

              + workload_metadata_config {
                  + mode = "GKE_METADATA"
                }
            }

          + upgrade_settings (known after apply)
        }

      + node_pool_auto_config (known after apply)

      + node_pool_defaults (known after apply)

      + notification_config {
          + pubsub {
              + enabled = false
                # (1 unchanged attribute hidden)
            }
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "10.0.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)

          + master_global_access_config {
              + enabled = true
            }
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + security_posture_config {
          + mode               = "DISABLED"
          + vulnerability_mode = "VULNERABILITY_DISABLED"
        }

      + service_external_ips_config (known after apply)

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + vertical_pod_autoscaling {
          + enabled = false
        }

      + workload_identity_config {
          + workload_pool = "deployment-433913.svc.id.goog"
        }
    }

  # module.gke.google_container_node_pool.pools["deployment-node-pool-dev"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster                     = "deployment-gke-cluster-dev"
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west4-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "deployment-node-pool-dev"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = [
          + "europe-west4-a",
        ]
      + operation                   = (known after apply)
      + project                     = "deployment-433913"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 100
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + network_config (known after apply)

      + node_config {
          + disk_size_gb                = 30
          + disk_type                   = "pd-standard"
          + effective_taints            = (known after apply)
          + enable_confidential_storage = false
          + guest_accelerator           = (known after apply)
          + image_type                  = "COS_CONTAINERD"
          + labels                      = {
              + "cluster_name" = "deployment-gke-cluster-dev"
              + "node_pool"    = "deployment-node-pool-dev"
            }
          + local_ssd_count             = 0
          + logging_variant             = "DEFAULT"
          + machine_type                = "e2-standard-2"
          + metadata                    = {
              + "cluster_name"             = "deployment-gke-cluster-dev"
              + "disable-legacy-endpoints" = "true"
              + "node_pool"                = "deployment-node-pool-dev"
            }
          + min_cpu_platform            = (known after apply)
          + oauth_scopes                = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible                 = false
          + service_account             = "tf-gke-deployment-gke--edxt@deployment-433913.iam.gserviceaccount.com"
          + spot                        = true
          + tags                        = [
              + "gke-deployment-gke-cluster-dev",
              + "gke-deployment-gke-cluster-dev-deployment-node-pool-dev",
            ]
            # (1 unchanged attribute hidden)

          + confidential_nodes (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = 1
          + max_unavailable = 0
          + strategy        = "SURGE"

          + blue_green_settings (known after apply)
        }
    }

  # module.gke_auth.data.google_client_config.provider will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_client_config" "provider" {
      + access_token   = (sensitive value)
      + default_labels = (known after apply)
      + id             = (known after apply)
      + project        = (known after apply)
      + region         = (known after apply)
      + zone           = (known after apply)
    }

  # module.gke_auth.data.google_container_cluster.gke_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "gke_cluster" {
      + addons_config                            = (known after apply)
      + allow_net_admin                          = (known after apply)
      + authenticator_groups_config              = (known after apply)
      + binary_authorization                     = (known after apply)
      + cluster_autoscaling                      = (known after apply)
      + cluster_ipv4_cidr                        = (known after apply)
      + confidential_nodes                       = (known after apply)
      + cost_management_config                   = (known after apply)
      + database_encryption                      = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + default_snat_status                      = (known after apply)
      + deletion_protection                      = (known after apply)
      + description                              = (known after apply)
      + dns_config                               = (known after apply)
      + enable_autopilot                         = (known after apply)
      + enable_cilium_clusterwide_network_policy = (known after apply)
      + enable_intranode_visibility              = (known after apply)
      + enable_k8s_beta_apis                     = (known after apply)
      + enable_kubernetes_alpha                  = (known after apply)
      + enable_l4_ilb_subsetting                 = (known after apply)
      + enable_legacy_abac                       = (known after apply)
      + enable_multi_networking                  = (known after apply)
      + enable_shielded_nodes                    = (known after apply)
      + enable_tpu                               = (known after apply)
      + endpoint                                 = (known after apply)
      + fleet                                    = (known after apply)
      + gateway_api_config                       = (known after apply)
      + id                                       = (known after apply)
      + identity_service_config                  = (known after apply)
      + initial_node_count                       = (known after apply)
      + ip_allocation_policy                     = (known after apply)
      + label_fingerprint                        = (known after apply)
      + location                                 = "europe-west4-a"
      + logging_config                           = (known after apply)
      + logging_service                          = (known after apply)
      + maintenance_policy                       = (known after apply)
      + master_auth                              = (known after apply)
      + master_authorized_networks_config        = (known after apply)
      + master_version                           = (known after apply)
      + mesh_certificates                        = (known after apply)
      + min_master_version                       = (known after apply)
      + monitoring_config                        = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = (known after apply)
      + network                                  = (known after apply)
      + network_policy                           = (known after apply)
      + networking_mode                          = (known after apply)
      + node_config                              = (known after apply)
      + node_locations                           = (known after apply)
      + node_pool                                = (known after apply)
      + node_pool_auto_config                    = (known after apply)
      + node_pool_defaults                       = (known after apply)
      + node_version                             = (known after apply)
      + notification_config                      = (known after apply)
      + operation                                = (known after apply)
      + private_cluster_config                   = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = "deployment-433913"
      + release_channel                          = (known after apply)
      + remove_default_node_pool                 = (known after apply)
      + resource_labels                          = (known after apply)
      + resource_usage_export_config             = (known after apply)
      + security_posture_config                  = (known after apply)
      + self_link                                = (known after apply)
      + service_external_ips_config              = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = (known after apply)
      + tpu_ipv4_cidr_block                      = (known after apply)
      + vertical_pod_autoscaling                 = (known after apply)
      + workload_identity_config                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ cluster_ca_certificate = (sensitive value)
  ~ cluster_name           = "deployment-gke-cluster-dev" -> (known after apply)
  ~ host                   = (sensitive value)
  ~ token                  = (sensitive value)

  ```
</details>


<details><summary>Terraform plan validation check (infrastructure-live_cd-clusters_dev_cluster)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>